#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/public-ips-test/runs/run-gfp1MXS3FUzKs8fU

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_eip.fnx_peplink_ip["13.213.210.190"]: Refreshing state... [id=eipalloc-000703ea0e5321bcf]
aws_eip.wireguard_ip["test"]: Refreshing state... [id=eipalloc-07c5ad62413e48210]
aws_eip.fnx_peplink_ip["18.142.89.92"]: Refreshing state... [id=eipalloc-0bd085f086cd79b41]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.fnx_peplink_ip["13.213.210.190"] has changed
  ~ resource "aws_eip" "fnx_peplink_ip" {
      + association_id       = "eipassoc-01586197b710be804"
        id                   = "eipalloc-000703ea0e5321bcf"
      + instance             = "i-0e9f7e5251f57da4a"
      + network_interface    = "eni-0b307d5316cd480dc"
      + private_dns          = "ip-10-4-244-53.ap-southeast-1.compute.internal"
      + private_ip           = "10.4.244.53"
        tags                 = {
            "Name" = "peplink-public-ip-1"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_eip.fnx_peplink_ip["18.142.89.92"] has changed
  ~ resource "aws_eip" "fnx_peplink_ip" {
      + association_id       = "eipassoc-016fcfb94b2d211f8"
        id                   = "eipalloc-0bd085f086cd79b41"
      + instance             = "i-0e9f7e5251f57da4a"
      + network_interface    = "eni-0b307d5316cd480dc"
      + private_dns          = "ip-10-4-244-54.ap-southeast-1.compute.internal"
      + private_ip           = "10.4.244.54"
        tags                 = {
            "Name" = "peplink-public-ip-2"
        }
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_eip.wireguard_ip["3.0.2.25"] will be created
  + resource "aws_eip" "wireguard_ip" {
      + address              = "3.0.2.25"
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "wireguard-public-ip-1"
        }
      + tags_all             = {
          + "Name" = "wireguard-public-ip-1"
          + "Type" = "Managed by Terraform"
        }
      + vpc                  = true
    }

  # aws_eip.wireguard_ip["test"] will be destroyed
  # (because key ["test"] is not in for_each map)
  - resource "aws_eip" "wireguard_ip" {
      - allocation_id        = "eipalloc-07c5ad62413e48210" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-07c5ad62413e48210" -> null
      - network_border_group = "ap-southeast-1" -> null
      - public_dns           = "ec2-3-0-2-25.ap-southeast-1.compute.amazonaws.com" -> null
      - public_ip            = "3.0.2.25" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "wireguard-public-ip"
        } -> null
      - tags_all             = {
          - "Name" = "wireguard-public-ip"
        } -> null
      - vpc                  = true -> null

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @JoseFMP, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Action for Pull Requests`*